Catalogs/КомбинацииПродуктовПереработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КомбинацииПродуктовПереработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПродуктыПереработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПродуктПереработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродуктыПереработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КомбинацииПродуктовПереработки/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ПродуктыПереработки.Сортировать("ПродуктПереработки возр");
	
	СтрокаНаим = "";
	
	Для Каждого СтрокаТЧ из ПродуктыПереработки Цикл
		
		СтрокаНаим = СтрокаНаим + "; "+ СтрокаТЧ.ПродуктПереработки.Наименование;
		
	КонецЦикла;
	 НаименованиеПолное = Сред(СтрокаНаим,3);

	Наименование = НаименованиеПолное;
    
КонецПроцедуры
